In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1': np.random.randn(5),
                   'dataset2': np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.568730 -1.275499
1  X   beta -0.037645 -0.277998
2  Y  alpha  0.246086 -0.509673
3  Y   beta -1.844744 -1.287968
4  Z  alpha -0.050739 -1.275196

In [4]:
group1= dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [7]:
group1.mean()

k1
X    0.265543
Y   -0.799329
Z   -0.050739
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])

In [9]:
month = np.array(['Jan','Feb','Jan','Feb','Jan'])

In [10]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  Feb   -0.037645
    Jan    0.246086
NY  Feb   -1.844744
    Jan    0.258995
Name: dataset1, dtype: float64

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.265543 -0.776749
Y  -0.799329 -0.898821
Z  -0.050739 -1.275196

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.568730 -1.275499
   beta  -0.037645 -0.277998
Y  alpha  0.246086 -0.509673
   beta  -1.844744 -1.287968
Z  alpha -0.050739 -1.275196

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [30]:
for name, group in dframe.groupby('k1'):
    print ('This is the %s group' %name)
    print (group)
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.568730 -1.275499
1  X   beta -0.037645 -0.277998


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.246086 -0.509673
3  Y   beta -1.844744 -1.287968


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.050739 -1.275196

In [31]:
dframe.groupby('k1')

In [34]:
for (k1, k2), group in dframe.groupby(['k1','k2']):
    print ('key1 = %s key2 =  %s' %(k1,k2))
    print (group)
    print ('\n')

key1 = X key2 =  alpha
  k1     k2  dataset1  dataset2
0  X  alpha   0.56873 -1.275499


key1 = X key2 =  beta
  k1    k2  dataset1  dataset2
1  X  beta -0.037645 -0.277998


key1 = Y key2 =  alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.246086 -0.509673


key1 = Y key2 =  beta
  k1    k2  dataset1  dataset2
3  Y  beta -1.844744 -1.287968


key1 = Z key2 =  alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.050739 -1.275196

In [35]:
group_dict = dict(list(dframe.groupby('k1')))

In [36]:
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha  0.568730 -1.275499
 1  X   beta -0.037645 -0.277998, 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha  0.246086 -0.509673
 3  Y   beta -1.844744 -1.287968, 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha -0.050739 -1.275196}

In [37]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.568730 -1.275499
1  X   beta -0.037645 -0.277998

In [38]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [39]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.568730 -1.275499
 1 -0.037645 -0.277998
 2  0.246086 -0.509673
 3 -1.844744 -1.287968
 4 -0.050739 -1.275196, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [40]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [42]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.275499
   beta  -0.277998
Y  alpha -0.509673
   beta  -1.287968
Z  alpha -1.275196